AccumulationRegisters/упОстаткиМатериалов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>упОстаткиМатериалов</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Количество</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаБезНДС</Name>
					<Comment>Сумма в валюте управленческого учета, без НДС </Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаСНДС</Name>
					<Comment>Сумма в валюте управленческого учета, с НДС </Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Материал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упЗапчасти</v8:Type>
						<v8:Type>cfg:CatalogRef.упГСМ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.упЗаправкаСливГСМ</v8:Type>
						<v8:Type>cfg:DocumentRef.упПоступлениеМатериалов</v8:Type>
						<v8:Type>cfg:DocumentRef.упКорректировкаОстатковМатериалов</v8:Type>
						<v8:Type>cfg:DocumentRef.упПутевойЛист</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСклады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/упЦеныЗапчастей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>упЦеныЗапчастей</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Запчасть</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упЗапчасти</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/упПрочиеРасходы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>упПрочиеРасходы</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаБезНДС</Name>
					<Comment>Сумма в валюте управленческого учета, без НДС </Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаСНДС</Name>
					<Comment>Сумма в валюте управленческого учета, с НДС </Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВалютаБезНДС</Name>
					<Comment>Сумма в валюте документа, без НДС</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВалютаСНДС</Name>
					<Comment>Сумма в валюте документа, с НДС</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упНаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяРасходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСтатьиДоходовРасходов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>АналитическийРазрез</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упАналитическиеРазрезы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/упНаработкаОборудования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>упНаработкаОборудования</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Пробег</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Пробег</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Моточасы</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВремяРаботы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВидДвиженияПробег</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упВидДвиженияПробег</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Оборудование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упШиныУзлыИАгрегаты</v8:Type>
						<v8:Type>cfg:CatalogRef.упДополнительноеОборудование</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/упАгрегатыНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>упАгрегатыНаСкладах</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Количество</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Агрегат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упШиныУзлыИАгрегаты</v8:Type>
						<v8:Type>cfg:CatalogRef.упДополнительноеОборудование</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСклады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/упАгрегатыТранспортныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>упАгрегатыТранспортныхСредств</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Операция</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упТипыОперацийМонтажа</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ХодоваяШина</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Агрегат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упШиныУзлыИАгрегаты</v8:Type>
						<v8:Type>cfg:CatalogRef.упДополнительноеОборудование</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/упВидДвиженияПробег.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>упВидДвиженияПробег</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВводНачальныхОстатков</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Приход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Корректировка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/упТипыОперацийМонтажа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>упТипыОперацийМонтажа</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Установлено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Снято</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/упАналитическиеРазрезы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>упАналитическиеРазрезы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упПартнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упПодразделенияПартнеров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОперацияСистемыПлатон</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Агрегат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упШиныУзлыИАгрегаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПеревозки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упВидыПеревозок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/упСтатьиДоходовРасходов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>упСтатьиДоходовРасходов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Агрегат</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантРасходов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упВариантыРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПеревозки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРасхода</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упВидыРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоМесяцевПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОпределятьНаправлениеДеятельностиПриРаспределении</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОпределятьПодразделениеПриРаспределении</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокРаспределения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПравилаРаспределения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упПравилаРаспределенияРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПравилоРаспределенияКосвенныхРасходовНаФинансовыйРезультат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упПравилаРаспределенияКосвенныхРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПравилоРаспределенияКосвенныхРасходовПоРейсам</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упПравилаРаспределенияКосвенныхРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПравилоРаспределенияКосвенныхРасходовПоТС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упПравилаРаспределенияКосвенныхРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упСтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяСписанияРасходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСтатьиДоходовРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСтатьиДоходовИРасходов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упТипыСтатейДоходовРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/упУправлениеЗапасами/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Процедура расчета суммы списания материалов.
//
// Параметры:
//	ДополнительныеСвойства - Структура - Свойства.
//	Ссылка - ДокументСсылка - Ссыкла на элемент.
//	Реквизиты - Структура - Реквизиты.
//	Отказ - Булево - Применить изменения.
//
Процедура РассчитатьСуммыСписанияМатериалов(ДополнительныеСвойства, Ссылка, Реквизиты, Отказ) Экспорт
	
	упСЛК.СоздатьОбъект().РассчитатьСуммыСписанияМатериалов(ДополнительныеСвойства, Ссылка, Реквизиты, Отказ);
		
КонецПроцедуры

// Формирует строки сторнирования по остаткам материалов.
//
// Параметры:
//	ДополнительныеСвойства - Структура - Свойства.
//	Реквизиты - Структура - Реквизиты.
//	Отказ - Булево - Применить изменения.
//
Процедура ДобавитьСторнированиеОстатковМатериалов(ДополнительныеСвойства, Реквизиты, Отказ) Экспорт
	
	Если Отказ Тогда 
		Возврат; 
	КонецЕсли;
	
	Если Не ДополнительныеСвойства.Свойство("ОстаткиМатериалов") Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Материалы", ДополнительныеСвойства.ОстаткиМатериалов);
	Запрос.УстановитьПараметр("Дата"     , Реквизиты.Граница);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Материалы.Склад,
	|	Материалы.Материал
	|ПОМЕСТИТЬ втМатериалы
	|ИЗ
	|	&Материалы КАК Материалы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	упОстаткиМатериалов.Склад,
	|	упОстаткиМатериалов.Материал,
	|	упОстаткиМатериалов.Партия,
	|	-упОстаткиМатериалов.КоличествоОстаток КАК Количество,
	|	-упОстаткиМатериалов.СуммаБезНДСОстаток КАК СуммаБезНДС,
	|	-упОстаткиМатериалов.СуммаСНДСОстаток КАК СуммаСНДС
	|ИЗ
	|	РегистрНакопления.упОстаткиМатериалов.Остатки(
	|			&Дата,
	|			(Материал, Склад) В
	|				(ВЫБРАТЬ
	|					втМатериалы.Материал,
	|					втМатериалы.Склад
	|				ИЗ
	|					втМатериалы)) КАК упОстаткиМатериалов";
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
		    ЗаполнитьЗначенияСвойств(ДополнительныеСвойства.ОстаткиМатериалов.Добавить(),  Выборка);
		КонецЦикла; 
	КонецЕсли; 
	
КонецПроцедуры

// Контроль отрицательных остатков материалов.
//
// Параметры:
//	ДополнительныеСвойства - Структура - Свойства.
//	Ссылка - ДокументСсылка - Ссыкла на элемент.
//	Движения - КоллекцияДвижений - Коллекция движений документа.
//	Реквизиты - Структура - Реквизиты.
//	Отказ - Булево - Применить изменения.
//
Процедура КонтрольОстатковМатериалов(ДополнительныеСвойства, Ссылка, Движения, Реквизиты, Отказ) Экспорт
	
	Если Отказ Тогда 
		Возврат; 
	КонецЕсли;
	
	Если Не ДополнительныеСвойства.Свойство("ОстаткиМатериалов") Тогда
		Возврат; 
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", Реквизиты.Граница);	
	Запрос.УстановитьПараметр("ДатаИсключаяДвижения", Реквизиты.ГраницаИсключая);	
	Запрос.МенеджерВременныхТаблиц = ДополнительныеСвойства.МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"
	|ВЫБРАТЬ
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(втМатериалы.Склад) КАК Склад,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(втМатериалы.Материал) КАК Материал,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(втМатериалы.Материал.ЕдиницаИзмерения) КАК ЕдиницаИзмерения,
	|	ЕСТЬNULL(- упОстаткиМатериалов.КоличествоОстаток, 0) КАК КоличествоОстаток,
	|	ЕСТЬNULL(упОстаткиМатериаловДоПроведения.КоличествоОстаток, 0) КАК КоличествоОстатокДоПроведения
	|ИЗ
	|	втМатериалы КАК втМатериалы
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.упОстаткиМатериалов.Остатки(
	|		&Дата,
	|		(Материал, Склад) В (
	|				ВЫБРАТЬ
	|				втМатериалы.Материал КАК Материал,
	|				втМатериалы.Склад КАК Склад
	|			ИЗ
	|				втМатериалы КАК втМатериалы)) КАК упОстаткиМатериалов
	|	ПО ИСТИНА
	|		И втМатериалы.Материал = упОстаткиМатериалов.Материал
	|		И втМатериалы.Склад = упОстаткиМатериалов.Склад
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.упОстаткиМатериалов.Остатки(
	|		&ДатаИсключаяДвижения,
	|		(Материал, Склад) В (
	|				ВЫБРАТЬ
	|				втМатериалы.Материал КАК Материал,
	|				втМатериалы.Склад КАК Склад
	|			ИЗ
	|				втМатериалы КАК втМатериалы)) КАК упОстаткиМатериаловДоПроведения
	|	ПО ИСТИНА
	|		И втМатериалы.Материал = упОстаткиМатериаловДоПроведения.Материал
	|		И втМатериалы.Склад = упОстаткиМатериаловДоПроведения.Склад
	|ГДЕ ЕСТЬNULL(упОстаткиМатериалов.КоличествоОстаток, 0) < 0
	|";
	
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			ТекстСообщения = НСтр(СтрШаблон("ru = 'Недостаточно остатков материала ""%1"". На складе: ""%2"" доступно для списания %3 %4'", Выборка.Материал, Выборка.Склад, Выборка.КоличествоОстатокДоПроведения, Выборка.ЕдиницаИзмерения));
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		КонецЦикла; 
	КонецЕсли;  
	
КонецПроцедуры

#Область ФормированиеДвижений

// Процедура формирует записи регистра "упОстаткиМатериалов".
//
// Параметры:
//	ДополнительныеСвойства - Структура - Свойства.
//	Ссылка - ДокументСсылка - Ссыкла на элемент.
//	Движения - КоллекцияДвижений - Коллекция движений документа.
//	Реквизиты - Структура - Реквизиты.
//	Отказ - Булево - Применить изменения.
//
Процедура СформироватьДвиженияОстаткиМатериалов(ДополнительныеСвойства, Ссылка, Движения, Реквизиты, Отказ) Экспорт
	
	Если Отказ Тогда 
		Возврат; 
	КонецЕсли;

	ДвиженияОстаткиМатериалов = Движения.упОстаткиМатериалов;
	ДвиженияОстаткиМатериалов.Записывать = Истина;
	
	Если ДополнительныеСвойства.Свойство("ОстаткиМатериалов") Тогда
		Для каждого текСтрока Из ДополнительныеСвойства.ОстаткиМатериалов Цикл
			Движение = ДвиженияОстаткиМатериалов.Добавить();
			Движение.Период = Реквизиты.Дата;
			ЗаполнитьЗначенияСвойств(Движение, текСтрока);
		КонецЦикла; 
	КонецЕсли; 
	
КонецПроцедуры	

// Процедура формирует записи регистра "упЦеныЗапчастей".
//
// Параметры:
//	ДополнительныеСвойства - Структура - Свойства.
//	Ссылка - ДокументСсылка - Ссыкла на элемент.
//	Движения - КоллекцияДвижений - Коллекция движений документа.
//	Реквизиты - Структура - Реквизиты.
//	Отказ - Булево - Применить изменения.
//
Процедура СформироватьДвиженияЦеныЗапчастей(ДополнительныеСвойства, Ссылка, Движения, Реквизиты, Отказ) Экспорт
	
	Если Отказ Тогда 
		Возврат; 
	КонецЕсли;

	ДвиженияЦеныЗапчастей = Движения.упЦеныЗапчастей;
	ДвиженияЦеныЗапчастей.Записывать = Истина;
	
	Если ДополнительныеСвойства.Свойство("ЦеныЗапчастей") Тогда
		Для каждого текСтрока Из ДополнительныеСвойства.ЦеныЗапчастей Цикл
			Движение = ДвиженияЦеныЗапчастей.Добавить();
			Движение.Период = Реквизиты.Дата;
			ЗаполнитьЗначенияСвойств(Движение, текСтрока);
		КонецЦикла; 
	КонецЕсли;
	
КонецПроцедуры	

// Процедура формирует записи по регистру "упПрочиеРасходы".
//
// Параметры:
//	ДополнительныеСвойства - Структура - Свойства.
//	Ссылка - ДокументСсылка - Ссылка на элемент.
//	Движения - КоллекцияДвижений - Коллекция движений документа.
//	Реквизиты - Структура - Реквизиты.
//	Отказ - Булево - Применить изменения.
//
Процедура СформироватьДвиженияПрочиеРасходы(ДополнительныеСвойства, Ссылка, Движения, Реквизиты, Отказ) Экспорт

	Если Отказ Тогда 
		Возврат; 
	КонецЕсли;
	
	ДвиженияРасходы		  = Движения.упПрочиеРасходы;
	ДвиженияРасходы.Записывать = Истина;
	
	ВедетсяВалютныйУчет	= ДополнительныеСвойства.ВедетсяВалютныйУчет; 
	тбзПрочиеРасходы 	= ДополнительныеСвойства.ПрочиеРасходы;
	
	ОрганизацияПоУмолчанию = Справочники.Организации.ПустаяСсылка();
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Реквизиты, "Организация") Тогда
		ОрганизацияПоУмолчанию = Реквизиты.Организация;	
	КонецЕсли;
	
	ПодразделениеПоУмолчанию = Справочники.упСтруктураПредприятия.ПустаяСсылка();
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Реквизиты, "Подразделение") Тогда
		ПодразделениеПоУмолчанию = Реквизиты.Подразделение;	
	КонецЕсли;

	НаправлениеДеятельностиПоУмолчанию = Справочники.упНаправленияДеятельности.ПустаяСсылка();
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Реквизиты, "НаправлениеДеятельности") Тогда
		НаправлениеДеятельностиПоУмолчанию = Реквизиты.НаправлениеДеятельности;	
	КонецЕсли;

	АналитическийРазрезПоУмолчанию = Справочники.упАналитическиеРазрезы.ПустаяСсылка();
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Реквизиты, "АналитическийРазрез") Тогда
		АналитическийРазрезПоУмолчанию = Реквизиты.АналитическийРазрез;	
	КонецЕсли;

	СтатьяРасходовПоУмолчанию = Справочники.упСтатьиДоходовРасходов.ПустаяСсылка();
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Реквизиты, "СтатьяРасходов") Тогда
		СтатьяРасходовПоУмолчанию = Реквизиты.СтатьяРасходов;	
	КонецЕсли;
	
	
	Если НЕ тбзПрочиеРасходы = Неопределено Тогда
		Для каждого СтрокаРасход Из тбзПрочиеРасходы Цикл
			ДвижениеРасход = ДвиженияРасходы.Добавить();
			ЗаполнитьЗначенияСвойств(ДвижениеРасход, СтрокаРасход);
			
			Если НЕ ЗначениеЗаполнено(ДвижениеРасход.Период) Тогда
				ДвижениеРасход.Период      = Реквизиты.Дата;
			КонецЕсли;
			
			ДвижениеРасход.Регистратор = Ссылка;
						
			Если Истина
				И НЕ ЗначениеЗаполнено(ДвижениеРасход.Организация)
				И ЗначениеЗаполнено(ОрганизацияПоУмолчанию)
			Тогда
				ДвижениеРасход.Организация = ОрганизацияПоУмолчанию;
			КонецЕсли;
			
			Если Истина
				И НЕ ЗначениеЗаполнено(ДвижениеРасход.Подразделение)
				И ЗначениеЗаполнено(ПодразделениеПоУмолчанию) 
			Тогда
				ДвижениеРасход.Подразделение = ПодразделениеПоУмолчанию;
			КонецЕсли;
			
			Если Истина
				И НЕ ЗначениеЗаполнено(ДвижениеРасход.НаправлениеДеятельности)
				И ЗначениеЗаполнено(НаправлениеДеятельностиПоУмолчанию)
			Тогда
				ДвижениеРасход.НаправлениеДеятельности = НаправлениеДеятельностиПоУмолчанию;
			КонецЕсли;
			
			Если Истина
				И НЕ ЗначениеЗаполнено(ДвижениеРасход.АналитическийРазрез)
				И ЗначениеЗаполнено(АналитическийРазрезПоУмолчанию)
			Тогда
				ДвижениеРасход.АналитическийРазрез = АналитическийРазрезПоУмолчанию;
			КонецЕсли;
			
			Если Истина
				И НЕ ЗначениеЗаполнено(ДвижениеРасход.СтатьяРасходов)
				И ЗначениеЗаполнено(СтатьяРасходовПоУмолчанию)
			Тогда
				ДвижениеРасход.СтатьяРасходов = СтатьяРасходовПоУмолчанию;
			КонецЕсли;
			
			Если ВедетсяВалютныйУчет Тогда
				ДвижениеРасход.Валюта            = СтрокаРасход.Валюта;
				ДвижениеРасход.СуммаСНДС         = СтрокаРасход.Сумма;
				ДвижениеРасход.СуммаБезНДС       = СтрокаРасход.СуммаБезНДС;
				ДвижениеРасход.СуммаВалютаСНДС   = СтрокаРасход.СуммаВалюта;
				ДвижениеРасход.СуммаВалютаБезНДС = СтрокаРасход.СуммаБезНДСВалюта;
			Иначе
				ДвижениеРасход.Валюта            = Справочники.Валюты.ПустаяСсылка();
				ДвижениеРасход.СуммаСНДС         = СтрокаРасход.Сумма;
				ДвижениеРасход.СуммаБезНДС       = СтрокаРасход.СуммаБезНДС;	
				ДвижениеРасход.СуммаВалютаСНДС   = 0;
				ДвижениеРасход.СуммаВалютаБезНДС = 0;
			КонецЕсли;	
		КонецЦикла;
	КонецЕсли;	
КонецПроцедуры

// Процедура формирует записи по регистру "упПробегТС".
//
// Параметры:
//	ДополнительныеСвойства - Структура - Свойства.
//	Ссылка - ДокументСсылка - Ссылка на элемент.
//	Движения - КоллекцияДвижений - Коллекция движений документа.
//	Реквизиты - Структура - Реквизиты.
//	Отказ - Булево - Применить изменения.
//
Процедура СформироватьДвиженияНаработкаОборудования(ДополнительныеСвойства, Ссылка, Движения, Реквизиты, Отказ) Экспорт
		
	Если Отказ Тогда 
		Возврат; 
	КонецЕсли;

	ДвиженияНаработкаОборудования = Движения.упНаработкаОборудования;
	ДвиженияНаработкаОборудования.Записывать = Истина;
	
	ТаблицаДвижений = Неопределено;
	
	Если ДополнительныеСвойства.Свойство("ДополнительноеОборудованиеПробег", ТаблицаДвижений) Тогда 
		Для каждого Строка Из ТаблицаДвижений Цикл
			Если Ложь
				Или ЗначениеЗаполнено(Строка.Пробег) 
				Или ЗначениеЗаполнено(Строка.Моточасы)
			Тогда
				Движение = ДвиженияНаработкаОборудования.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
				Движение.Период 	 = Реквизиты.Дата;
				Движение.ВидДвиженияПробег = Перечисления.упВидДвиженияПробег.ВводНачальныхОстатков;
				ЗаполнитьЗначенияСвойств(Движение, Строка); 
			КонецЕсли; 
		КонецЦикла; 
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область УчетШинУзловИАгрегатов

// Проверка табличной части на дубли.
// 
// Параметры:
//	ТабличнаяЧасть - ТабличнаяЧасть - Табличная Часть.
//	ИмяТаблЧасти - Строка - имя табличной части.
//	Ссылка - ДокументСсылка - ссылка на документ.
//	Отказ - Булево - истина, если найдены дубли. Ложь если дублей нет.
//
Процедура ТабличнаяЧастьНеСодержитДублей(ТабличнаяЧасть, ИмяТаблЧасти, Ссылка, Отказ) Экспорт
	
	Если Отказ Тогда 
		Возврат; 
	КонецЕсли;
			
	Если Лев(ИмяТаблЧасти, СтрДлина("ДополнительноеОборудование")) = "ДополнительноеОборудование" Тогда
		ТекстСообщения = НСтр("ru = 'В табличной части ""%1"" присутствуют строки с продублированным доп. оборудованием. %2.'");	
		ИмяПоля						= "ДополнительноеОборудование";
		ИмяТабличнойЧастиДляПользователя	= Нстр("ru = 'Дополнительное оборудование'");
	Иначе
		ТекстСообщения	= НСтр("ru = 'В табличной части ""%1"" присутствуют строки с продублированными агрегатами. %2.'");	
		ИмяПоля		= "Агрегат";
		ИмяТабличнойЧастиДляПользователя	= Нстр("ru = 'Агрегаты'");
	КонецЕсли;
	
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.упРемонтИТОТС") Тогда
		Если ИмяТаблЧасти = "ШиныУзлыАгрегатыСобственные" Тогда
			ИмяТабличнойЧастиДляПользователя = Нстр("ru = 'Шины, узлы, агрегаты собственные'");	
		ИначеЕсли ИмяТаблЧасти = "ШиныУзлыАгрегаты" Тогда
			ИмяТабличнойЧастиДляПользователя = Нстр("ru = 'Шины, узлы, агрегаты'");	
		ИначеЕсли ИмяТаблЧасти = "ДополнительноеОборудованиеСобственные" Тогда
			ИмяТабличнойЧастиДляПользователя = Нстр("ru = 'Дополнительное оборудование собственное'");	
		КонецЕсли;
	ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.упИзменениеСостоянийОборудования") Тогда
		ИмяПоля	= "Оборудование";
		ИмяТабличнойЧастиДляПользователя	= Нстр("ru = 'Оборудование'");
	КонецЕсли;
	
	ТекстСообщения = СтрШаблон(ТекстСообщения, ИмяТабличнойЧастиДляПользователя, Ссылка);
	
	Для каждого тбчСтрока Из ТабличнаяЧасть Цикл
		ТекущийИндекс = ТабличнаяЧасть.Индекс(тбчСтрока);
		Отбор = Новый Структура(ИмяПоля,тбчСтрока[ИмяПоля]);	  
		НайденныеСтроки = ТабличнаяЧасть.НайтиСтроки(Отбор);
		Если НайденныеСтроки.Количество() > 1 Тогда
			Для каждого текСтрока Из НайденныеСтроки Цикл
				ИндексСтроки = ТабличнаяЧасть.Индекс(текСтрока);
				Если НЕ ТекущийИндекс = ИндексСтроки Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,Ссылка,"Объект." + ИмяТаблЧасти + "[" + Формат(ИндексСтроки,"ЧН=0; ЧГ=0") + "]." + ИмяПоля);
				КонецЕсли;
			КонецЦикла;		
			Отказ = Истина;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;  
	
КонецПроцедуры // КонтрольТабличнойЧастиАгрегаты()

// Процедура формирует записи регистра "упАгрегатыНаСкладах".
//
// Параметры:
//	ДополнительныеСвойства - Структура - Свойства.
//	Ссылка - ДокументСсылка - Ссыкла на элемент.
//	Движения - КоллекцияДвижений - Коллекция движений документа.
//	Реквизиты - Структура - Реквизиты.
//	Отказ - Булево - Применить изменения.
//
Процедура СформироватьДвиженияАгрегатов(ДополнительныеСвойства, Ссылка, Движения, Реквизиты, Отказ) Экспорт
	
	Если Отказ Тогда 
		Возврат; 
	КонецЕсли;
	
	ДвиженияАгрегатыНаСкладах = Движения.упАгрегатыНаСкладах;
	ДвиженияАгрегатыНаСкладах.Записывать = Истина;
	
	Если ДополнительныеСвойства.Свойство("ОстаткиАгрегатов") Тогда
		Для каждого текСтрока Из ДополнительныеСвойства.ОстаткиАгрегатов Цикл
			Движение = ДвиженияАгрегатыНаСкладах.Добавить();
			Движение.Период = Реквизиты.Дата;
			ЗаполнитьЗначенияСвойств(Движение, текСтрока);
		КонецЦикла; 
	КонецЕсли; 
	
КонецПроцедуры // СформироватьДвиженияАгрегатов()

// Процедура формирует записи регистра "упАгрегатыТранспортныхСредств".
//
// Параметры:
//	ДополнительныеСвойства - Структура - Свойства.
//	Ссылка - ДокументСсылка - Ссыкла на элемент.
//	Движения - КоллекцияДвижений - Коллекция движений документа.
//	Реквизиты - Структура - Реквизиты.
//	Отказ - Булево - Применить изменения.
//
Процедура СформироватьДвиженияАгрегатовНаТС(ДополнительныеСвойства, Ссылка, Движения, Реквизиты, Отказ) Экспорт
	
	Если Отказ Тогда 
		Возврат; 
	КонецЕсли;
	
	ДвиженияАгрегатыТС = Движения.упАгрегатыТранспортныхСредств;
	ДвиженияАгрегатыТС.Записывать = Истина;
	
	Если ДополнительныеСвойства.Свойство("АгрегатыНаТС") Тогда
		Для каждого текСтрока Из ДополнительныеСвойства.АгрегатыНаТС Цикл
			Движение = ДвиженияАгрегатыТС.Добавить();
			Движение.Период = Реквизиты.Дата;
			ЗаполнитьЗначенияСвойств(Движение, текСтрока);
		КонецЦикла; 
	КонецЕсли; 
	
КонецПроцедуры // СформироватьДвиженияАгрегатовНаТС()

// Функция - Агрегаты по транспортному средству.
//
// Параметры:
//  Период			 - Дата - дата запроса.
//  ТранспортноеСредство	 - СправочникСсылка.упТранспортныеСредства - транспортное средство.
// 
// Возвращаемое значение:
//  Массив - агрегаты (СправочникСсылка.упШиныУзлыИАгрегаты) установленные на ТС.
//
Функция АгрегатыПоТранспортномуСредству(Период, ТранспортноеСредство) Экспорт
	
	Результат = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст =	"ВЫБРАТЬ
	|	упАгрегатыТранспортныхСредствСрезПоследних.Агрегат КАК Агрегат
	|ИЗ
	|	РегистрСведений.упАгрегатыТранспортныхСредств.СрезПоследних(&Период, ) КАК упАгрегатыТранспортныхСредствСрезПоследних
	|ГДЕ
	|	упАгрегатыТранспортныхСредствСрезПоследних.Операция = ЗНАЧЕНИЕ(Перечисление.упТипыОперацийМонтажа.Установлено)
	|	И упАгрегатыТранспортныхСредствСрезПоследних.ТранспортноеСредство = &ТранспортноеСредство
	|	И упАгрегатыТранспортныхСредствСрезПоследних.Агрегат.Ссылка ССЫЛКА Справочник.упШиныУзлыИАгрегаты";
	Запрос.УстановитьПараметр("ТранспортноеСредство", ТранспортноеСредство);
	Запрос.УстановитьПараметр("Период", Период);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл                                                   
		Результат.Добавить(Выборка.Агрегат);			
	КонецЦикла; 
	
	Возврат Результат;
		
КонецФункции

// Функция - На какое ТС установлен агрегат или доп. оборудование.
//
// Параметры:
//  Период	 - Дата - дата запроса.
//  Агрегат	 - СправочникСсылка.упДополнительноеОборудование - оборудование или агрегат.
//			 - СправочникСсылка.упШиныУзлыИАгрегаты             
// 
// Возвращаемое значение:
//  СправочникСсылка.упТранспортныеСредства - транспортное средство.
//
Функция ТранспортноеСредстваПоАгрегату(Период, Агрегат) Экспорт
	
	Результат = Справочники.упТранспортныеСредства.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст =	"ВЫБРАТЬ
	|	упАгрегатыТранспортныхСредствСрезПоследних.ТранспортноеСредство КАК ТранспортноеСредство
	|ИЗ
	|	РегистрСведений.упАгрегатыТранспортныхСредств.СрезПоследних(&Период, Агрегат = &Агрегат) КАК упАгрегатыТранспортныхСредствСрезПоследних
	|ГДЕ
	|	упАгрегатыТранспортныхСредствСрезПоследних.Операция = ЗНАЧЕНИЕ(Перечисление.упТипыОперацийМонтажа.Установлено)";
	Запрос.УстановитьПараметр("Агрегат", Агрегат);
	Запрос.УстановитьПараметр("Период",  Период);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = Выборка.ТранспортноеСредство;			
	КонецЕсли; 
	
	Возврат Результат;
		
КонецФункции

#КонецОбласти


#Область СлужебныеПроцедурыФункции

// Нет.

#КонецОбласти
